siade/spec/fixtures/payloads/ants/found_siv_with_cotitulaire.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <siv:rep_consulter_dossier xmlns:siv="http://siv.mi.fr/DefinitionsServices/2007-06">
      <siv:control>
        <siv:code_partenaire>ants_siv_code_partenaire</siv:code_partenaire>
        <siv:code_miat>ants_siv_code_miat</siv:code_miat>
        <siv:date_envoi>2025-10-17T10:16:07+02:00</siv:date_envoi>
        <siv:type_operation>Consultation Dossier</siv:type_operation>
        <siv:numero_session>rnd_2125d522-2d37-49f6-be1b-da5231232f37</siv:numero_session>
        <siv:code_traitement>0</siv:code_traitement>
        <siv:code_operation>2453923760</siv:code_operation>
        <siv:date_reception>2025-10-17T12:16:07+02:00</siv:date_reception>
        <siv:type_fichier_joint>xml</siv:type_fichier_joint>
      </siv:control>
      <siv:reponse>
        <siv:dossier>
          <siv:immatriculation>
            <siv:num_immat>AA-123-BB</siv:num_immat>
            <siv:date_prem_immat>2011-03-11</siv:date_prem_immat>
            <siv:date_att_immat>2011-03-11</siv:date_att_immat>
            <siv:code_type_immat>N</siv:code_type_immat>
            <siv:libelle_type_immat>Normale</siv:libelle_type_immat>
          </siv:immatriculation>
          <siv:vehicule>
            <siv:caracteristiques_techniques>
              <siv:marque_vehicule>CITROEN</siv:marque_vehicule>
              <siv:tvv>UD9HR8/2P</siv:tvv>
              <siv:cnit>M10CTRVP000C932</siv:cnit>
              <siv:denomination_com>C4 PICASSO</siv:denomination_com>
              <siv:vin>VF7UD9HR8BJ551390</siv:vin>
              <siv:code_couleur>18</siv:code_couleur>
              <siv:libelle_couleur>GRIS FONCE</siv:libelle_couleur>
              <siv:pt>2060</siv:pt>
              <siv:ptac>2060</siv:ptac>
              <siv:ptra>3000</siv:ptra>
              <siv:pt_service>1495</siv:pt_service>
              <siv:ptav>1420</siv:ptav>
              <siv:categorie_ce>M1</siv:categorie_ce>
              <siv:genre_national>VP</siv:genre_national>
              <siv:carrosserie_ce>AC</siv:carrosserie_ce>
              <siv:carrosserie_national>BREAK</siv:carrosserie_national>
              <siv:num_reception>e2*2001/116*0345*15</siv:num_reception>
              <siv:type_reception>CE</siv:type_reception>
              <siv:cylindree>1560</siv:cylindree>
              <siv:puissance_nette_max>82</siv:puissance_nette_max>
              <siv:energie>GO</siv:energie>
              <siv:puissance_cv>6</siv:puissance_cv>
              <siv:places_assises>5</siv:places_assises>
              <siv:niveau_sonore>75</siv:niveau_sonore>
              <siv:vitesse>2700</siv:vitesse>
              <siv:co2>132</siv:co2>
              <siv:classe_environnement_ce>715/2007*692/2008EURO5</siv:classe_environnement_ce>
            </siv:caracteristiques_techniques>
          </siv:vehicule>
          <siv:personne>
            <siv:nb_cotitulaires>1</siv:nb_cotitulaires>
            <siv:liste_personnes>
              <siv:personne>
                <siv:code_type_personne>CTI</siv:code_type_personne>
                <siv:libelle_type_personne>cotitulaire</siv:libelle_type_personne>
                <siv:identite_personne>
                  <siv:flag_pers_physique>oui</siv:flag_pers_physique>
                  <siv:nom_naiss>LUIGI</siv:nom_naiss>
                  <siv:prenom>MARIO</siv:prenom>
                  <siv:sexe>M</siv:sexe>
                  <siv:flag_pre_cotitulaire>oui</siv:flag_pre_cotitulaire>
                </siv:identite_personne>
              </siv:personne>
              <siv:personne>
                <siv:code_type_personne>TIT</siv:code_type_personne>
                <siv:libelle_type_personne>titulaire</siv:libelle_type_personne>
                <siv:identite_personne>
                  <siv:flag_pers_physique>oui</siv:flag_pers_physique>
                  <siv:nom_naiss>SHEPARD</siv:nom_naiss>
                  <siv:prenom>JOHN</siv:prenom>
                  <siv:sexe>M</siv:sexe>
                  <siv:date_naissance>1987-08-09</siv:date_naissance>
                  <siv:lieu_naissance>CITADEL</siv:lieu_naissance>
                  <siv:pays_naissance>EARTH</siv:pays_naissance>
                </siv:identite_personne>
                <siv:adresse_personne>
                  <siv:num_voie>42</siv:num_voie>
                  <siv:libelle_voie>RUE DE LA NORMANDY</siv:libelle_voie>
                  <siv:code_postal>75001</siv:code_postal>
                  <siv:libelle_commune>PARIS</siv:libelle_commune>
                </siv:adresse_personne>
              </siv:personne>
            </siv:liste_personnes>
          </siv:personne>
        </siv:dossier>
      </siv:reponse>
    </siv:rep_consulter_dossier>
  </soapenv:Body>
</soapenv:Envelope>
